platformio/platform-ststm32/misc/svd/STM32F756.svd
            <register>
               <name>CSR12</name>
               <displayName>CSR12</displayName>
               <description>context swap registers</description>
               <addressOffset>0x128</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR12</name>
                     <description>CSR12</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR13</name>
               <displayName>CSR13</displayName>
               <description>context swap registers</description>
               <addressOffset>0x12C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR13</name>
                     <description>CSR13</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR14</name>
               <displayName>CSR14</displayName>
               <description>context swap registers</description>
               <addressOffset>0x130</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR14</name>
                     <description>CSR14</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR15</name>
               <displayName>CSR15</displayName>
               <description>context swap registers</description>
               <addressOffset>0x134</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR15</name>
                     <description>CSR15</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR16</name>
               <displayName>CSR16</displayName>
               <description>context swap registers</description>
               <addressOffset>0x138</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR16</name>
                     <description>CSR16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR17</name>
               <displayName>CSR17</displayName>
               <description>context swap registers</description>
               <addressOffset>0x13C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR17</name>
                     <description>CSR17</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR18</name>
               <displayName>CSR18</displayName>
               <description>context swap registers</description>
               <addressOffset>0x140</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR18</name>
                     <description>CSR18</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR19</name>
               <displayName>CSR19</displayName>
               <description>context swap registers</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR19</name>
                     <description>CSR19</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR20</name>
               <displayName>CSR20</displayName>
               <description>context swap registers</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR20</name>
                     <description>CSR20</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR21</name>
               <displayName>CSR21</displayName>
               <description>context swap registers</description>
               <addressOffset>0x14C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR21</name>
                     <description>CSR21</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR22</name>
               <displayName>CSR22</displayName>
               <description>context swap registers</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR22</name>
                     <description>CSR22</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR23</name>
               <displayName>CSR23</displayName>
               <description>context swap registers</description>
               <addressOffset>0x154</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR23</name>
                     <description>CSR23</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR24</name>
               <displayName>CSR24</displayName>
               <description>context swap registers</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR24</name>
                     <description>CSR24</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR25</name>
               <displayName>CSR25</displayName>
               <description>context swap registers</description>
               <addressOffset>0x15C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR25</name>
                     <description>CSR25</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR26</name>
               <displayName>CSR26</displayName>
               <description>context swap registers</description>
               <addressOffset>0x160</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR26</name>
                     <description>CSR26</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR27</name>
               <displayName>CSR27</displayName>
               <description>context swap registers</description>
               <addressOffset>0x164</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR27</name>
                     <description>CSR27</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR28</name>
               <displayName>CSR28</displayName>
               <description>context swap registers</description>
               <addressOffset>0x168</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR28</name>
                     <description>CSR28</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR29</name>
               <displayName>CSR29</displayName>
               <description>context swap registers</description>
               <addressOffset>0x16C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR29</name>
                     <description>CSR29</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR30</name>
               <displayName>CSR30</displayName>
               <description>context swap registers</description>
               <addressOffset>0x170</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR30</name>
                     <description>CSR30</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR31</name>
               <displayName>CSR31</displayName>
               <description>context swap registers</description>
               <addressOffset>0x174</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR31</name>
                     <description>CSR31</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR32</name>
               <displayName>CSR32</displayName>
               <description>context swap registers</description>
               <addressOffset>0x178</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR32</name>
                     <description>CSR32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR33</name>
               <displayName>CSR33</displayName>
               <description>context swap registers</description>
               <addressOffset>0x17C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR33</name>
                     <description>CSR33</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR34</name>
               <displayName>CSR34</displayName>
               <description>context swap registers</description>
               <addressOffset>0x180</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR34</name>
                     <description>CSR34</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR35</name>
               <displayName>CSR35</displayName>
               <description>context swap registers</description>
               <addressOffset>0x184</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR35</name>
                     <description>CSR35</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR36</name>
               <displayName>CSR36</displayName>
               <description>context swap registers</description>
               <addressOffset>0x188</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR36</name>
                     <description>CSR36</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR37</name>
               <displayName>CSR37</displayName>
               <description>context swap registers</description>
               <addressOffset>0x18C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR37</name>
                     <description>CSR37</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR38</name>
               <displayName>CSR38</displayName>
               <description>context swap registers</description>
               <addressOffset>0x190</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR38</name>
                     <description>CSR38</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR39</name>
               <displayName>CSR39</displayName>
               <description>context swap registers</description>
               <addressOffset>0x194</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR39</name>
                     <description>CSR39</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR40</name>
               <displayName>CSR40</displayName>
               <description>context swap registers</description>
               <addressOffset>0x198</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR40</name>
                     <description>CSR40</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR41</name>
               <displayName>CSR41</displayName>
               <description>context swap registers</description>
               <addressOffset>0x19C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR41</name>
                     <description>CSR41</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR42</name>
               <displayName>CSR42</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1A0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR42</name>
                     <description>CSR42</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR43</name>
               <displayName>CSR43</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1A4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR43</name>
                     <description>CSR43</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR44</name>
               <displayName>CSR44</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1A8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR44</name>
                     <description>CSR44</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR45</name>
               <displayName>CSR45</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1AC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR45</name>
                     <description>CSR45</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR46</name>
               <displayName>CSR46</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1B0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR46</name>
                     <description>CSR46</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSR47</name>
               <displayName>CSR47</displayName>
               <description>context swap registers</description>
               <addressOffset>0x1B4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSR47</name>
                     <description>CSR47</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
