platformio/platform-ststm32/misc/svd/STM32F756.svd
            <register>
               <name>HIFCR</name>
               <displayName>HIFCR</displayName>
               <description>high interrupt flag clear           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CTCIF7</name>
                     <description>Stream x clear transfer complete               interrupt flag (x = 7..4)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHTIF7</name>
                     <description>Stream x clear half transfer interrupt               flag (x = 7..4)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF7</name>
                     <description>Stream x clear transfer error interrupt               flag (x = 7..4)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDMEIF7</name>
                     <description>Stream x clear direct mode error               interrupt flag (x = 7..4)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFEIF7</name>
                     <description>Stream x clear FIFO error interrupt flag               (x = 7..4)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTCIF6</name>
                     <description>Stream x clear transfer complete               interrupt flag (x = 7..4)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHTIF6</name>
                     <description>Stream x clear half transfer interrupt               flag (x = 7..4)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF6</name>
                     <description>Stream x clear transfer error interrupt               flag (x = 7..4)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDMEIF6</name>
                     <description>Stream x clear direct mode error               interrupt flag (x = 7..4)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFEIF6</name>
                     <description>Stream x clear FIFO error interrupt flag               (x = 7..4)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTCIF5</name>
                     <description>Stream x clear transfer complete               interrupt flag (x = 7..4)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHTIF5</name>
                     <description>Stream x clear half transfer interrupt               flag (x = 7..4)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF5</name>
                     <description>Stream x clear transfer error interrupt               flag (x = 7..4)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDMEIF5</name>
                     <description>Stream x clear direct mode error               interrupt flag (x = 7..4)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFEIF5</name>
                     <description>Stream x clear FIFO error interrupt flag               (x = 7..4)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTCIF4</name>
                     <description>Stream x clear transfer complete               interrupt flag (x = 7..4)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHTIF4</name>
                     <description>Stream x clear half transfer interrupt               flag (x = 7..4)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF4</name>
                     <description>Stream x clear transfer error interrupt               flag (x = 7..4)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDMEIF4</name>
                     <description>Stream x clear direct mode error               interrupt flag (x = 7..4)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFEIF4</name>
                     <description>Stream x clear FIFO error interrupt flag               (x = 7..4)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>S0CR</name>
               <displayName>S0CR</displayName>
               <description>stream x configuration           register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHSEL</name>
                     <description>Channel selection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>MBURST</name>
                     <description>Memory burst transfer               configuration</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PBURST</name>
                     <description>Peripheral burst transfer               configuration</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CT</name>
                     <description>Current target (only in double buffer               mode)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBM</name>
                     <description>Double buffer mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PL</name>
                     <description>Priority level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PINCOS</name>
                     <description>Peripheral increment offset               size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSIZE</name>
                     <description>Memory data size</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PSIZE</name>
                     <description>Peripheral data size</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MINC</name>
                     <description>Memory increment mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PINC</name>
                     <description>Peripheral increment mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CIRC</name>
                     <description>Circular mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Data transfer direction</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PFCTRL</name>
                     <description>Peripheral flow controller</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIE</name>
                     <description>Transfer complete interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIE</name>
                     <description>Half transfer interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIE</name>
                     <description>Transfer error interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIE</name>
                     <description>Direct mode error interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Stream enable / flag stream ready when               read low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>S0NDTR</name>
               <displayName>S0NDTR</displayName>
               <description>stream x number of data           register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>S0PAR</name>
               <displayName>S0PAR</displayName>
               <description>stream x peripheral address           register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>S0M0AR</name>
               <displayName>S0M0AR</displayName>
               <description>stream x memory 0 address           register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>M0A</name>
                     <description>Memory 0 address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>S0M1AR</name>
               <displayName>S0M1AR</displayName>
               <description>stream x memory 1 address           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>M1A</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>S0FCR</name>
               <displayName>S0FCR</displayName>
               <description>stream x FIFO control register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000021</resetValue>
               <fields>
                  <field>
                     <name>FEIE</name>
                     <description>FIFO error interrupt               enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FS</name>
                     <description>FIFO status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DMDIS</name>
                     <description>Direct mode disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FTH</name>
                     <description>FIFO threshold selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>S1CR</name>
               <displayName>S1CR</displayName>
               <description>stream x configuration           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHSEL</name>
                     <description>Channel selection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>MBURST</name>
                     <description>Memory burst transfer               configuration</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PBURST</name>
                     <description>Peripheral burst transfer               configuration</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ACK</name>
                     <description>ACK</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CT</name>
                     <description>Current target (only in double buffer               mode)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBM</name>
                     <description>Double buffer mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PL</name>
                     <description>Priority level</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PINCOS</name>
                     <description>Peripheral increment offset               size</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSIZE</name>
                     <description>Memory data size</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PSIZE</name>
                     <description>Peripheral data size</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MINC</name>
                     <description>Memory increment mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PINC</name>
                     <description>Peripheral increment mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CIRC</name>
                     <description>Circular mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Data transfer direction</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PFCTRL</name>
                     <description>Peripheral flow controller</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIE</name>
                     <description>Transfer complete interrupt               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTIE</name>
                     <description>Half transfer interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIE</name>
                     <description>Transfer error interrupt               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMEIE</name>
                     <description>Direct mode error interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Stream enable / flag stream ready when               read low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>S1NDTR</name>
               <displayName>S1NDTR</displayName>
               <description>stream x number of data           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>S1PAR</name>
               <displayName>S1PAR</displayName>
               <description>stream x peripheral address           register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
